EDT/УТ/src/Documents/ГрупповаяУстановкаСтатусовСкладскогоУчета/ГрупповаяУстановкаСтатусовСкладскогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГрупповаяУстановкаСтатусовСкладскогоУчета</name>
  <registerRecords>InformationRegister.СтатусыСкладскогоУчета</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиЗаказов</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСкладскогоУчета</name>
    <type>
      <types>CatalogRef.СтатусыСкладскогоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалОбработки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтатусыЗаказов</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСкладскогоУчета</name>
      <type>
        <types>CatalogRef.СтатусыСкладскогоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Documents/ГрупповаяУстановкаСтатусовСкладскогоУчета/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
        Объект.Дата = ТекущаяДата();  
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	// МАС - 31.10.2017 - Заполняем док по возврату --->> 
	Если Параметры.Свойство("ДокВозврат") И ЗначениеЗаполнено(Параметры.ДокВозврат) Тогда

		Если Параметры.Статус = "Подготовлен" Тогда
			
			Объект.СтатусСкладскогоУчета = Справочники.СтатусыСкладскогоУчета.ПодготовленКВозврату;
			Объект.Основание = Параметры.ДокВозврат;
			
			ТЗТовары = Параметры.ДокВозврат.Товары.Выгрузить();
			ТЗТовары.Свернуть("ДокументПоступления,ТипЗаказа");		
			
			Для каждого Ст Из ТЗТовары Цикл
			
				НСтр = Объект.СтатусыЗаказов.Добавить();			
				НСтр.Заказ = Документы.РеализацияТоваровУслуг.НайтиПоНомеру(Ст.ДокументПоступления.Номер);
				Если НЕ ЗначениеЗаполнено(НСтр.Заказ) Тогда	
					Продолжить;					
				КонецЕсли;
				НСтр.СтатусСкладскогоУчета = Справочники.СтатусыСкладскогоУчета.ПодготовленКВозврату;
				НСтр.ТипЗаказа = Ст.ТипЗаказа;
			
			КонецЦикла;			
			
		Иначе		
		КонецЕсли;			
	
	КонецЕсли;	
	// <<--- МАС 	
	
КонецПроцедуры
